/******************************************************************************
 * Copyright (C) 2023 Nymph <Academy of Artemis>
 * Copyright (C) 2023 liulitchi <kz-xy@163.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 
 
 * Ακαδημία της Αρτέμιδος(Academy of Artemis) is a loosely connected 
 * network of math learning group, whose members share a common interest 
 * in mathematics and statistics and often exchange their learning 
 * experiences with one another.
 *
 * This file is copied
 * from https://zh.wikisource.org/wiki/%E9%9D%88%E6%A3%8B%E7%B6%93 , and 
 * redistributed by liulitchi.
 *
 * words.h: 卦辞
 *
 * Last edited: 2023/6/21
 ******************************************************************************/
 
 
char gram111[] = "一上一中一下\n\n大通卦 升騰之象 純陽得令 乾天西北\n象曰： 從小至大，無有顛沛； 自下升高，遂至富豪。 宜出遠行，不利伏韜。\n詩曰： 變豹文成彩，乘龍福自臻。 赤身承富貴，事事可更新。\n";

char gram112[] = "一上一中二下\n\n漸泰卦 待時之象 陰正得位 巽風東南\n象曰： 安居布業，治產有人。 既富且貴，祿位未及。\n詩曰： 好事臨門戶，金雞躍日輝， 陰陽恰相助，獨跨彩鸞歸。\n";

char gram113[] = "一上一中三下\n\n吉慶卦 富昌之象 純陽有位 乾天西北\n象曰： 巍巍赫赫，家有金帛。 物備事辦，不求自獲。\n詩曰： 貴人集集向門前，戶內多逢喜氣駢。 利祿天然成富貴，平生物理盡周全。\n";

char gram114[] = "一上一中四下\n\n富盛卦 通泰之象 陰盛得位 巽風東南\n象曰： 富盛貴極，天道反側。 隨運上下，與時消息。 子子孫孫，以萬以億。\n詩曰： 輕舟迎浪去如飛，百事營求正及時。 更與貴人同道路，從茲百福自追隨。\n";

char gram121[] = "一上二中一下\n\n樂道卦 驚喜之象 陽剛陰柔 離火正南\n象曰： 外剛內柔，和合自周。 養性保命，與神俱游。\n詩曰： 兩人和合見歡情，求望營謀事可成， 縱有青蛇須撓亂，到頭不害利和名。\n";

char gram122[] = "一上二中二下\n\n驚怖卦 小危之象 陰極陽孤 艮山東北\n象曰： 雄雞晝鳴，登屋延頸。 雌在牆下，為狸所驚。 絕聲來赴，得免損傾。\n詩曰： 暗中防陷阱，江海起風波， 回首歡娛處，翻成作苦痾。\n";

char gram123[] = "一上二中三下\n\n年豐卦 宜田之象 陰去陽來 離火正南\n象曰： 正月上午，歲在大梁。 東風解凍，宜爾田桑。 歲終豐稔，歡樂洋洋。\n詩曰： 鬱氣都消盡，春來萬物榮。 田蠶宜爾室，耕鑿樂蒼生。\n";

char gram124[] = "一上二中四下\n\n小戒卦 慎防之象 陰盛克陽 艮山東北\n象曰： 禍從下興，戒慎童僕。 陰謀潛合，欲動手足。\n詩曰： 喪釜薪何在？家門慮焰殃。 錢財終有失，童僕也須防。\n";

char gram131[] = "一上三中一下\n\n得志卦 自足之象 純陽在位 乾天西北\n象曰： 顯然得志，與時相值。 財來足用，不乏驅使。\n詩曰： 運與時相值，雲龍風虎從。 秉公名器在，聲達帝王宮。\n";

char gram132[] = "一上三中二下\n\n事遂卦 將泰之象 陰陽相合 巽風東南\n象曰： 昔未如意，今得從志。 萬事獲理，明白行事。\n詩曰： 兀兀塵埃久待時，幽窗寂寞有誰知？ 運逢帶劍人相顧，利遂名成總有期。\n";

char gram133[] = "一上三中三下\n\n才達卦 安吉之象 群陽下盛 乾天西北\n象曰： 濟濟多士，令德輝光。 相見歡喜，長樂無殃。\n詩曰： 貴人相暗助，藏用得相宜。 莫訝花枝少，須知結果遲。\n";

char gram134[] = "一上三中四下\n\n恣游卦 行樂之象 陰陽得位 巽風東南\n象曰： 乘龍駕驥，邀游四方。 歡心適意，行樂無疆。\n詩曰： 獨坐高樓憶舊游，月明如晝水東流。 當年有約應無失，以此相逢笑未休。\n";

char gram141[] = "一上四中一下\n\n憂患卦 孤立之象 二陽隔陰 離火正南\n象曰： 上單下孤，為奸所圖。 心腹之疾，不可卒除。 待至陽春，乃得自如。\n詩曰： 成立未安身，驚憂常在心。 幾回遭險阻，何日遇知音。\n";

char gram142[] = "一上四中二下\n\n慎德卦 禦寇之象 陰極反位 艮山東北\n象曰： 天地寬舒，小人自如。 禁令不行，盜瞰我廬。\n詩曰： 群凶彌六合，日月蔽風塵。 修德從今省，猶難免禍。\n";

char gram143[] = "一上四中三下\n\n行令卦 破賊之象 陰居中位 離火正南\n象曰： 君命師士，討賊奸凶。 尋戈張戟，大有所從。\n詩曰： 射鹿一時興，須憑眾力成。 蟠桃今已熟，舉目始享榮。\n又： 鹿走眾相弛，功名在此時。 奸雄今已矣，四海洽雍熙。\n";

char gram144[] = "一上四中四下\n\n將損卦 戰敗之象 陰極克陽 艮山東北\n象曰： 豺虎咆哮，淋淫雨水。 戰鬥不勝，弱兵鈍士。 為寇所凌，多有亡死。\n詩曰： 射雉終難獲，懷珍未得財。 經求並進望，足步動危災。\n又： 勢微防敵寇，失盜致火危， 人事皆如此，天時未順機。\n";

char gram211[] = "二上一中一下\n\n神護卦 神嘏之象 陰居陽位 兌金正西\n象曰： 太乙將兵，玉女在旁。 巫咸先拂，除去不祥。\n詩曰： 云談蟾光暗，花開雨半殘。 解除終獲福，恬退且求安。\n";

char gram212[] = "二上一中二下\n\n將敗卦 淫蠱之象 兩陰制陽 坎水正北\n象曰： 兩女一夫，上下相祛。 陰氣乘陽，遂用耗虛。\n詩曰： 孤陽微兮，群陰盜兮， 力既殫兮，將不可耄兮， 慎兮！慎兮！宜自保兮。\n";

char gram213[] = "二上一中三下\n\n理亂卦 抑奸之象 陰竊陽位 兌澤正西\n象曰： 天陰雲升，陽從下興， 君子治亂，小人畏懲。\n詩曰： 黃金百煉獨全真，白玉三投始見珍。 韞櫝未為人所羨，自甘肥遁且安貧。\n";

char gram214[] = "二上一中四下\n\n未還卦 流竄之象 群陰制陽 坎水正北\n象曰： 荒田土虛，人民遷居。 待年之豐，乃歸故廬。\n詩曰： 口舌致紛攘，經營事必傷。 若求陰德助，方見免災殃。\n";

char gram221[] = "二上二中一下\n\n戒貪卦 神耗之象 二陰反位 震雷正東\n象曰： 埋金藏玉，自言其貴。 鬼債不解，神不降福。\n詩曰： 恃富因忘本，貪過竟失中。 欺心天弗佑，神道不私功。\n";

char gram222[] = "二上二中二下\n\n安泰卦 賁園之象 純陰不動 坤地西南\n象曰： 歲富月昌，土田開張。 安如泰山，終無禍殃。\n詩曰： 一片中原土，春深雨露多。 用天因地利，安業樂熙和。\n";

char gram223[] = "二上二中三下\n\n昌吉卦 祿興之象 陰陽純吉 震雷正東\n象曰： 受天之福，如日之升。 少小仕宦．爵祿方興。\n詩曰： 命達風雲會，身依日月光。 祥煙浮寶殿，明月照金床。\n";

char gram224[] = "二上二中四下\n\n亨通卦 豐財之象 純陰得位 坤地西南\n象曰： 富如井泉，雖用無竭。 所求遂意，歡樂不絕。\n詩曰： 曉雨初晴映碧溪，重重春色上柴扉。 黃金不盡家殷富，何必區區羨錦衣。\n";

char gram231[] = "二上三中一下\n\n憂喜卦 餘慶之象 陰居天位 兌澤正西\n象曰： 心有所憂，耿耿不寐。 恐有患禍，而反福至。 慶賀忻悅，大為我利。\n詩曰： 孰知成立若升天，老去多憂夜不眠。 忽見故園春色好，翩翩蜂蝶鬥芳妍。\n";

char gram232[] = "二上三中二下\n\n平安卦 決疑之象 陰居上下 坎水正北\n象曰： 上下俱安，心不生奸。 坦然無憂，勿信流言。\n詩曰： 雙燕歸南國，來尋王謝家。 畫堂春晝靜，於此托生涯。\n";

char gram233[] = "二上三中三下\n\n闢惡卦 威德之象 陰弱陽強 兌澤正西\n象曰： 眾人愛我，闢除患禍。 狂犬不噬，萬事必果。\n詩曰： 一龍吐水正當春，草木沾濡盡發新。 喜得老人親語我，窮途從此始通津。\n";

char gram234[] = "二上三中四下\n\n大獲卦 利物之象 中陽制陰 坎水正北\n\n象曰： 韓廬逐兔，走不伸步。 噬兔在前，逐者在後。 頻頻重獲，略不得走。\n詩曰： 世道無荊棘，人心勿自嗟。 趁名兼逐利，勤苦遂生涯。\n";

char gram241[] = "二上四中一下\n\n衰微卦 複興之象 弱陽下升 震雷正東\n象曰： 聖賢相承，微而複興。 瓜瓞綿綿，漸而上升。\n詩曰： 夢入天台路，登山月朗明。 異哉春色別，重見舊花榮。\n";

char gram242[] = "二上四中二下\n\n避災卦 守靜之象 陽散陰極 坤地西南\n象曰： 夏往秋來，寒霜為災。 鳥獸毛氈，草木落荄。\n詩曰： 妄行遭地綱，輕舉入天羅。 謹慎方為上，抽身始保和。\n又： 天地正荒涼，從茲萬物傷。 豺狼當要路，賢士且潛藏。\n";

char gram243[] = "二上四中三下\n\n發蒙卦 天澤之象 陰變陽來 震雷正東\n象曰： 陰極陽生，蟄蟲開張。 大赦天下，鐘鼓堂堂。\n詩曰： 陰極方逢泰，蟄蟲戶始開。 三陽宜用事，名利一齊來。\n又： 天門日射彩雲開，大降洪恩布九垓。 萬物一時沾聖化，蒼生鼓舞醉金魁。\n";

char gram244[] = "二上四中四下\n\n病思卦 計窮之象 陰極成淫 坤地西南\n象曰： 陰淫小病，殭僕懷愁。 仰面望天，俯伏低頭。\n詩曰： 命蹇兮時違，災及告身疲。 皇天今不我顧，嗟我兮疾斯危。\n";

char gram311[] = "三上一中一下\n\n明陽卦 小吉之象 群陽用事 乾天西北\n象曰： 仕宦及時，祿與年期。 黽勉從事，慎勿失之。\n詩曰： 東風吹動九挈闕，和氣還從日下來。 凡事從今皆有喜，乘雲一舉上瑤台。\n";

char gram312[] = "三上一中二下\n\n天佑卦 特達之象 陰陽相宜 巽風東南\n象曰： 登高望遠，上見天衢。 玉女孔聖，授我靈符。 永錫難老，以保我軀。\n詩曰： 席上珍雖貴，還當待價沽。 運來亨又利，凡事不勞圖。\n又： 彼美人號，君子求兮。 懿德貞兮，錫我休兮。 永保貞兮，勿失猷兮。\n";

char gram313[] = "三上一中三下\n\n尊貴卦 神佑之象 陽明上下 乾天西北\n象曰： 明德孔光，萬壽無疆。 北斗七星，與我衛防。 得遷祿位，代代吉昌。\n詩曰： 車前無險阻，舟泛自通津。 雨露從天降，門庭又一新。\n";

char gram314[] = "三上一中四下\n\n宜禱卦 天賚之象 積陰克陽 巽風東南\n象曰： 數見怪異，要請巫硯。 祈禱求福，災消禍息。 大小獲安，神祗之力。\n詩曰： 愁到正堪傷，憂來瞪里防。 若逢寒共暑。方可脫災殃。\n又： 災異致愁腸，群陰卻勝陽。 願祈天謄佑，老幼得安康。\n";

char gram321[] = "三上二中一下\n\n送貨卦 豐利之象 陰獲外陽 離火正南\n象曰： 窖從南來，遺我良材。 寶貨珍玩，金碗玉杯。\n詩曰： 金谷紛紛花正開，群仙漂渺集瑤台。 傾金注玉驚卜眼，共醉春風日幾回。\n";

char gram322[] = "三上二中二下\n\n無難卦 安農之象 陰不乾陽 艮山東北\n象曰： 土地平安，無有艱難。 大宜種作，利用柱還。\n詩曰： 海闊雲開驛路賒，彩賒鸞銜詔下天涯。 生民樂業安如堵，仕進功名世所誇。\n";

char gram323[] = "三上二中三下\n\n恭和卦 和睦之象 陰陽承順 離火正南\n象曰： 在上方直，下人供職。 室家和諧，大小同力。有志不違，所求皆得。\n詩曰： 喜氣滿門庭，家中沒蹇怨。 貴人青盼處，從此轉通津。\n";

// 文辞有错讹
char gram324[] = "三上二中四下\n\n違克卦 背戾房之象 陰陽違克跟 艮山東北\n象曰： 下不從上，中不制外。 上下違克，紀綱亂敗。\n詩曰： 逢山須避險，遇水且懷憂。 歸到鄉閭日，須知兩尾牛。\n";

char gram331[] = "三上三中一下\n\n貞壽卦 隱德之象 純陽三應 乾天西北\n象曰： 商山四皓，養性行道。 呼吸元氣，可得不老。\n詩曰： 採蕨餐松絕世塵，白雲流水萬年春。 九重丹詔非吾願，成性存存獨養真。\n";

char gram332[] = "三上三中二下\n\n剛長卦 同心之象 陽處陰上 巽風東南\n象曰： 二人同心，俱為表裏。 共處一國，遞相唇齒。\n詩曰： 兩意相投處，天時複變通。 時來萬事遂，目下莫衝衝。\n";

char gram333[] = "三上三中三下\n\n強盛卦 眾輔之象 三陽極盛 乾天西北\n象曰： 眾盛複強，既富且昌。 利用建功，莫之禦當。\n詩曰： 已過危橋百事安，何需過慮有艱難。 蛇龍得志興雲雨，一上天衢便不凡。\n";

char gram334[] = "三上三中四下\n\n佳麗卦 宜陰之象 陰位得令 巽風東南\n象曰： 青版紫房，中有姬姜。 容顏發色，芝蘭吐芳。\n詩曰： 一雜花校艷更芳，清香馥鬱透蘭房。 因風吹送終成笑．好向筵前醉幾場。\n又： 採藥天台路轉迷，桃花流水賦佳期， 春風啼鳥多情思，寄與劉郎且莫歸。\n";

char gram341[] = "三上四中一下\n\n得祿卦 興運之象 陰居陽下 離火正南\n象曰： 君臣易位，方興大利。 駟馬行書，人得自恣。\n詩曰： 如舟濟巨川，如旱望霜雨。 四雨同一家，明君得良輔。\n";

char gram342[] = "三上四中二下\n\n凝滯卦 不定之象 群陰內隔 艮山東北\n象曰： 意有所規，恐不得施。 進退猶豫，不知所為。\n詩曰： 進退事難成，憂疑轉誤人。 要知亨泰日，直待一年春。\n";

char gram343[] = "三上四中三下\n\n惡消卦 吉臻之象 群陽克陰 離火正南\n象曰： 日出東隅，炎炎赫赫。 中有妖氛，反受熏炙。 群陽破陰，禍患解釋。\n詩曰： 欲進又徘徊，心危事不危。 水邊人指引，名利得榮歸。\n又： 群陰雖蔽盛，天日已開明， 大闡惟新化，乾坤自此寧。\n";

char gram344[] = "三上四中四下\n\n上正卦 聖治之象 陽逢陰制 艮山東北\n象曰： 上有賢君，下有讒臣。 日月明照，不見暗塵。\n詩曰： 惟英乃剛，惟哲乃明。 一人執正，群邪不興。 德式中兮，昌保其真。\n";

char gram411[] = "四上一中一下\n\n孤貧卦 逢難之象 群陰蔽陽 兌澤正西\n象曰： 出溫人寒，被薄衣單。 去我慈母，罹此橫愆。\n詩曰： 陽和欠發育，冷落不成春。 好似巫山夢，徒然惱悶人。\n";

char gram412[] = "四上一中二下\n\n潛龍卦 侯時之象 一陽制陰 坎水正北\n象曰： 舜躬耕田，至於歷山。 土沃年豐，歲取十千。\n詩曰： 運至時亨泰，憂心已解愁。 十分堪進用，事事可優游。\n又： 耕鑿宜安計，功名自有期。 志堅能忍性，非聖孰能之？\n";

char gram413[] = "四上一中三下\n\n益友卦 攸往之象 下陽化陰 兌澤正西\n象曰： 客有王孫，來叩我門。 語我福慶，往德蒙恩。\n許曰： 時至圖謀事必成，天恩欲到信光臨。 從來未遂平生志，今日逢君始稱心。\n";

char gram414[] = "四上一中四下\n\n奸長卦 多難之象 群陰制陽 坎水正北\n象曰： 契闊離居，反複多阻。 凡事不利，所為不舉。\n詩曰： 淹留歲月未能歸，事欲成時意轉非。 老去窮愁因命蹇，勸君莫恨世情微。\n";

char gram421[] = "四上二中一下\n\n神助卦 否極之象 一陽獨存 震雷正東\n象曰： 四師二符，對面仰頭。 天神下來，解釋系囚。 患害除愈，實獲天體。\n詩曰： 天雨布如霖，汪洋德澤新。 根枯蘇困滯，一日便通津。\n又： 精神感天地，陰氣自消融。 獨藉扶持力，皆因造化功。\n";

char gram422[] = "四上二中二下\n\n解祀卦 承吉之象 積陰無陽 坤地西南\n象曰： 家墓高丘，鬼神上游。 宜把鑲之，可得無憂。\n詩曰： 不必論窮通，當憂疾病中。 但將陰德報，造物有深功。\n又： 命既居襄難，不必嘆途窮。 扶育恩須報，神光自感通。\n";

char gram423[] = "四上二中三下\n\n抑災勢 擅禍之象 下陽制陰 震雷正東\n象曰： 金精欲起，賴得元士。 左手抑之，乃獲息正。\n詩曰： 幾年豹變藏深霧，一日鵬傳直上天。 若得金口人借力，自然榮貴在當年。\n又： 疾風知勁草，板蕩誠忠臣。 藉此匡扶力，乾坤物又新。\n"; 

char gram424[] = "四上二中四下\n\n祈亨卦 宜禱之象 陰極上下 坤地西南\n象曰： 宗廟祭祀，凶禍消止。 福來及門，殃去萬里。\n詩曰： 桌無一腳實難安，鼎有二足立座難。 所望所求終費力，切直祈福免傷殘。\n又： 孝以動天，誠以感神。 來享來格，福裕後人。\n";

// 元云改为玄灵，据《欽定四庫全書·子部七·術數類·靈棋經》，来源：中國哲學書電子化計劃(https://ctext.org)。
char gram431[] = "四上三中一下\n\n從心卦 複泰之象 眾陽尊陰 兌澤正西\n象曰： 玄靈在上，下無讒人。 百事流通，皆得歸真。\n詩曰： 名利尋常事，爭如未易圖。 時來兼運好，不用費工夫。\n又： 神象居尊位，人心且順時。 自然歸正道，猶賴眾匡維。\n";

char gram432[] = "四上三中二下\n\n得失卦 克強之象 陰暴陽存 坎水正北\n象曰： 失我寶珠，乃在天衢。 不意盜賊，隱匿所居。 賴得元鳥，為我逐祛。 風靜波息，還複我廬。\n詩曰： 舒眉展目黃金露，舉意江山顯舊廬。 釣在水中魚未獲，絲頭忽見一明珠。\n又： 塞公雖失馬，禍福豈由人？ 得道應多助。門庭又一新。\n";

char gram433[] = "四上三中三下\n\n救助教 複初之象 陰極陽剛 兌澤正西\n象曰： 司命來下，省察線圖。 算命未盡，橫被無辜。 即命扁鵲，以發玉壺。 賜藥—丸，乃得活蘇。\n詩曰： 慶事天來足可知，功名成就有其時。 愁人眉展醉入醒，一日生光萬里輝。\n又： 人生修短隨時化，禍福由來命使然。 倘得修身存大道，認教平地遇神仙。\n";

char gram434[] = "四上三中四下\n\n大同卦 通暢之象 三陽破陰 坎水正北\n象曰： 天衢坦坦，五達六通。 我行其中，乘雲駕龍。\n詩曰： 雲散月當空，牛前鼠後逢。 張弓方抵垛，一箭定前功。\n又： 位尊德盛，四夷咸從。 君子治亂，小人乃凶。\n";

char gram441[] = "四上四中一下\n\n沉翳卦 微存之象 群陰蔽陽 震雷正東\n象曰： 綿綿視息，無有氣力。 仰面呼天，低頭伏地。 求之不通，見之不得。\n詩曰： 依舊方成吉，交爭必到刑。 寧心還守待，莫羨別人榮。\n又： 進步多顛躓，爭求致禍危。 餘生徒嘆息。貧困事難為。\n";

char gram442[] = "四上四中二下\n\n陰長卦 凶裹之象 純陰不應 坤地西南\n象曰： 重陰在上，鬼氛浮溢。 中庭水深，堂下行舟。\n詩曰： 陰小須防謹，門庭亦未寧。 家中多撓聒，口舌暗中生。\n又： 積陰為厲雨淫淫，洪水懷山陸地沉。 大禹不施疏鑿計，蒼生何以洽歡心。\n";

char gram443[] = "四上四中三下\n\n遁世卦 困極之象 陽光失位 震雷正東\n象曰： 困於凶禍，閉門獨坐。 人徒分散，無可取火。\n詩曰： 運蹇實堪優，悲愁春複秋。 且謀西北避，身外莫營求。\n又： 德孤無鄰，孰為可親？ 君子失道，小人進身。\n";

char gram444[] = "四上四中四下\n\n眾凶卦 泰極之象 純陰同見 坤地西南\n象曰： 凶禍暴至，凡事不利。 疾病系官，動有顛躓。\n詩曰： 百尺竿頭路已窮，尋思無計轉飄蓬。 只知釣上鱸魚白，不覺翻身入浪中。\n又： 山窮路轉迷，水急舟難渡。 萬事莫剛為，處處遭奸妒。\n";

char gram110[] = "一上一中\n\n苦節卦 乾陽之象 二陽孤立 乾天西北\n象曰： 居貧辛苦，無有門戶。 出入烏桕，立錐無土。\n詩曰： 彩雲易散固難留，寂莫黃昏事可愁。 惟有陰功暗相助，也須憔悴帶心憂。\n";

char gram120[] = "一上二中\n\n歡悅卦 配偶之象 陰陽得合 艮山東北\n象曰： 夫婦相親，無有他人。 對膝而坐，恆有歡忻。\n詩曰： 兩重天上喜，君眼一齊開。 寂寞淹留脫，從伊展異材。\n又： 乾道既立，坤德柔兮。 彼美孟姜，君子求兮。 永與諧老，同德休兮。\n";

char gram130[] = "一上三中\n\n方遂卦 生成之象 二陽得位 乾天西北\n象曰： 處得其位，事得其意。 定意安心，福祿方至。 慶賀忻忻，長為我利。\n詩曰： 驟進徐行自有程，月沉西海日東升。 運來何必勞心力，風送江潮萬里清。\n";

char gram140[] = "一上四中\n\n鬼伺卦 憂病之象 陰竊中位 艮山東北\n象曰： 食不入口，氣不出鼻。 心腹煩結，使不得寐。\n詩曰： 同類須防反目時，從來相好變乖違。 當時貫朽空存坐，江上萋萋草正齊。\n又： 元氣轉散，精神恍惚。 雖有扁鵲，命亦傾覆。\n";

char gram210[] = "二上一中\n\n遲吉卦 終利之象 陰陽反覆 震雷正東\n象曰： 托人以事，日望其意。 乃至於今，方獲嘉喜。 事雖淹留，終遂其志。\n詩曰： 前程自有豐隆日，謀托終能稱我情。 更得貴人青眼顧，一時春色滿門庭。\n";

char gram220[] = "二上二中\n\n戒慎卦 憂離之象 二陽對中 坤地西南\n象曰： 雖安猶危，雖喜猶悲。 常恐分別，不得相隨。\n詩曰： 萬事不由人，悲歡在一身。 防微兼杜漸，處治莫因循。\n";

char gram230[]= "二上三中\n\n大成卦 知止之象 正陽處中 震雷正東\n象曰： 過我阡陌，駕車轔轔。 厥寶伊何，黃金白銀。 常使豐足，永不憂貧。\n詩曰： 受天之祿，必降禎祥。 務滿不溢，守之乃昌。 毋怠毋驕，永保安康。\n";

char gram240[] = "二上四中\n\n扶危卦 守節之象 正陰居中 坤地西南\n象曰： 聖人彬彬，其形若何？ 賢良內應，先哭後歌。\n又曰： 昨日出行，與禍相當。 流矢中我，目淚汪汪。\n詩曰： 雲橫山際水茫範，千里長途望故鄉。 蹇厄自來君莫恨，倚門惆悵立斜陽。\n又： 天生聖賢，抱道無位。 周流四方，以道為貴。 文質彬彬，拔乎其萃。\n";

char gram310[] = "三上一中\n\n福流卦 得天之象 三陽在上 乾天西北\n象曰： 連遇不泰，今與泰會。 非但一時，蔭及累代。\n詩曰： 風波今已息，舟楫遇安流。 自此功名遂，何須嘆白頭。\n";

char gram320[] = "三上二中\n\n晚就卦 有兆之象 陽列陰上 艮山東北\n象曰： 擔耒躬耕，四月舉趾。 黽勉趨時，黍稷靡靡。\n詩曰： 前程有路莫嫌遲，沙裏淘金得幾時。 淘盡沙泥金始出，兩重名利兩重宜。\n又： 農者躬耕，在勤有成。 播植以時，百穀豐登。 既飽既醉，樂不可勝。\n";

char gram330[] = "三上三中\n\n事君卦 合德之象 二陽相生 乾天西北\n象曰： 明君在上，下無奸匿。 朝服濟濟，無假黜涉。\n詩曰： 頭角低昂半出雲，爪牙方就免艱辛。 從今再逐雷霆化，須作人間天上人。\n又： 唐虞治世，君臣都俞。 四岳達聰，百揆允謨。 三載黜陟，邪惡永除。\n";

char gram340[] = "三上四中\n\n必得卦 收利之象 陰陽相應 艮山東北\n象曰： 韓盧逐兔，飛鷹搏雉。 無往不得，其獲足視。\n詩曰： 一片荊山玉，須憑巧匠求。 琢磨成大器，終得遇王侯。\n";

char gram410[] = "四上一中\n\n雪恥卦 負乘之象 陰蔽微陽 震雷正東\n象曰： 擔餉入田，不見耕夫。 盜鳥無狀，啄我乾脯。 挽弓射之，中其左羽。\n詩曰： 蒙頭不見路行人，獨坐幽窗未辨明。 山下水深舟未發，圖謀進用卒難成。\n";

char gram420[] = "四上二中\n\n戒進卦 宜退之象 群朗反位 坤地西南\n象曰： 醉中鬥爭，刀杖並起。 主人惶怖，自縛乃止。\n詩曰： 處理當思慮，求謀在見機。 樽前防暴客，謙退可無虞。\n";

char gram430[] = "四上三中\n\n戒逢卦 知止之象 陽居陰位 震雷正東\n象曰： 前有寇盜，後無行人。 安步止往，可得全身。\n詩曰： 行去未能多阻隔，更防陰小暗中傷。 名香一炷宜禳謝，保佑消災身自康。\n";

char gram440[] = "四上四中\n\n被絞卦 宜速之象 群陰浸盛 坤地西南\n象曰： 懸急如絞，救不能至。 魯望高子，不足為比。\n詩曰： 陽極凶危甚，生民已倒懸。 若無匡救力．焉得保生全。\n";

char gram11[] = "一中一下\n\n敬慎卦 昭德之象 二陽下升 乾天西北\n象曰： 昭德塞違，事在順機。 賢人慎始，君子防微。\n詩曰： 別有河沙路，休隨女子游。 莫嗟多蹇滯，得意便風流。\n又： 安居防危，涉險防欹。 毋怠毋忽，慎始得宜。\n";

char gram12[] = "一中二下\n\n帝道卦 德至之象 陰陽相通 艮山東北\n象曰： 天地同功，陰陽相通。 事業廣大，從西至東。 行來去處，難蹈其蹤。\n詩曰： 女子門前立，終然好事來。 從今無險阻，享福莫疑猜。\n又： 道大德至，功不可量。 君子進用，小人退藏。\n";

char gram13[] = "一中三下\n\n不定卦 狐疑之象 眾陽趨競 乾天西北\n象曰： 狐疑猶豫，意中不定。 進不可希，退宜從正。\n詩曰： 暗事出幽室，迷雲鎖洞房。 連枝人不見，獨自一愁傷。\n又： 岐多忘所向，天闊地無蹤。 進止君須慎，安身獨守窮。\n";

char gram14[] = "一中四下\n\n邪佞卦 積惡之象 群陰克陽 艮山東北\n象曰： 違天背君，不順倫理。 放恣邪佞，人皆切齒。\n詩曰： 望斷行人事漸虛，相逢陌上卻成疏。 當時許就平生計，等到如今不見渠。\n又： 奸邪蔽上，禍及善良。 背道逆理，下民怨望。 小人得志，君子遁藏。\n";

char gram21[] = "二中一下\n\n慎悔卦 顛錯之象 陰陽錯位 震雷正東\n象曰： 上下反錯，事皆失宜。 東西乖異，不相追隨。\n詩曰： 天事轉既危，人心亦自欺。 察言防不義，進退慎其為。\n";

char gram22[] = "二中二下\n\n宜初卦 防後之象 純陰缺陽 坤地西南\n象曰： 深思遠念，居實慮危。 今雖無患，終必傾虧。 行常正道，慎勿作欺。\n詩曰： 莫言小事只如親，卻恐因循事轉難。 不戒履霜馴至覆，堅冰恐失致傷殘。\n";

char gram23[] = "二中三下\n\n福會卦 敬慎之象 三陽助陰 震雷正東\n象曰： 德禳不樣，敬慎宜遵。 今雖隱約，福祿自臻。\n詩曰： 雕鶚當秋勢轉雄，乘風奮翼到蟾宮。 榮華若問時來事，先後聲名達九重。\n";

char gram24[] = "二中四下\n\n陰賊卦 後凶之象 陰盛失陽 坤地西南\n象曰： 陰賊逆謀，不利後代。 今雖適意，後亦不泰。\n詩曰： 一枝花欲發，卻值雨和風。 雲散多青黑，悉消福祿空。\n又： 險陰虧福，勢不可久。 禍起一身，空貽於後。\n";

char gram31[] = "三中一下\n\n福利卦 元亨之象 二陽主事 乾天西北\n象曰： 出門逢福，與善相得。 明珠夜照，使我不惑。\n。詩曰： 運達功名至，皇恩忽到家。 幾年桃李樹，春發滿園花。\n";

char gram32[] = "三中二下\n\n福祥卦 安泰之象 陰陽各安 艮山東北\n象曰： 天消地息，賢人安職。 行藏昌吉，有利無極。\n詩曰： 貌貅寶馬自駢闐，驚起湖山白晝眠。 千里悠然無阻礙，碧波勞草正連天。\n";

// 卦名为何？
char gram33[] = "三中三下\n\n攸敘卦 保寧之象 二陽純剛 乾天西北\n象曰： 鳳凰銜珠，來集庭隅。 福為我致，禍為我除。\n詩曰： 瑞物慶駢臻，光華五色新。 天恩今日到，福祿在斯人。\n";

char gram34[] = "三中四下\n\n否傾卦 任賢之象 三陽伏明 艮山東北\n象曰： 君子抗衡，小人低軀。 明君治世，分別紫朱。\n詩曰： 枯木春將近，山川秀氣盈。 門前雙鵲噪，喜報利名成。\n";

char gram41[] = "四中一下\n\n未形卦 龍升之象 獨陽升陰 震雷正東\n象曰： 潛龍將升，元云上起。 天下蒙祉，先否後喜。\n詩曰： 缺月複重圓，花枝色更鮮。 桃源歸去路，一日遇神仙\n";

char gram42[] = "四中二下\n\n蕩複卦 降災之象 純陰無應 坤地西南\n象曰： 天龍暴怒，雷公擊鼓。 興雲致雨，流潦下土。\n詩曰： 斟酌樽中酒，徘徊檻外花。 一場歡宴地，不覺夕陽斜。\n又： 日暝暝兮，水橫流兮。 稼穡害兮，魚鱉游兮。 陽曷霽兮，德不修兮。\n";

char gram43[] = "四中三下\n\n避世卦 遠遁之象 以陰凌陽 震雷正東\n象曰： 小人得志，君子失道。 去我室廬，入彼澤草。\n詩曰： 口舌向門來，身中且滯災。 人前防暗箭，第一恐傷財。\n又： 鑾駕離丹陛，燕雀傳青霄。 奸臣尤竊位，賢士利伏逃。\n";

char gram44[] = "四中四下\n\n鬼動卦 用術之象 二陰克戰 坤地西南\n象曰： 兩鬼共居，常苦飢虛。 欲入我戶，畏此靈符。\n詩曰： 暗地重陰鬼，將貽疾病優。 縱然符可御，也自被驚愁。\n";

char gram101[] = "一上一下\n\n微損卦 求安之象 二陽相隔 乾天西北\n象曰： 登樹採桑，墮地僕殭。 東鄰有藥，走往問方。 因遇良醫，得不損傷。\n詩曰： 欲履平途反遇難，若求名利不如閒。 憂中喜遇良醫手，留得殘生在世間。\n";

char gram102[] = "一上二下\n\n粗諧卦 終泰之象 陰陽得位 艮山東北\n象曰： 如新娶婦，居家未諧。 黽勉自力，嗣姓方續。\n詩曰： 誰家女子把戈矛，利祿須知向此求。 到得徹頭終快活，不妨歡愛且優游。\n";

char gram103[] = "一上三下\n\n不耕卦 中虛之象 二陽相隔 乾天西北\n象曰： 土急石堅，仰頭訴天。 耒耜不舉，禾稼缺然。\n詩曰： 有約還如夢，無緣事少成。 故人應不遇，千里月空明。\n";

// 据晉顏幼明之《墨海金壺》（卷113~114）补“迍”字。
// 文本来源：中国哲学书电子化计划(https://ctext.org)。
// 迍邅，亦作屯邅。形容行路艰难，或困顿不得志。
char gram104[] = "一上四下\n\n鬼災勢 虛耗之象 陰陽相隔 艮山東北\n象曰： 家有惡鬼，兩相對坐。 伺候過失，斷水絕火。 天地神祗，專察人過。\n詩曰： 空宅久埋塵，遷居每致迍。 只緣人命蹇，陰禍自纏身。\n";

char gram201[] ="二上一下\n\n空亡卦 缺望之象 陰陽反覆 震雷正東\n象曰： 入水伐木，登山捕魚。 損工失力，手空口虛。\n詩曰： 寶月盈時缺，長河濁且清。 縱然無咎害，也恐惹虛驚。\n";

char gram202[] = "二上二下\n\n不諧卦 不成之象 二陰不合 坤地西南\n象曰： 兩女無大，鬥爭各居。 出入異路，分別室廬。\n詩曰： 彩雲飛散水東流，寂寞黃昏事可愁。 縱使目前無一事，也須煩惱到中秋。\n";

char gram203[] = "二上三下\n\n習坎卦 虛勞之象 孤陽失位 震雷正東\n象曰： 二人相隨，欲行避危。 逢難落井，筋力無施。\n詩曰： 門戶自多煎，陰功好向前。 交加文字上，花發火中蓮。\n又： 事已防微，反遭其危。 如行入阱，如動發機。 禍不可解，福不可祈。\n";

char gram204[] = "二上四下\n\n來革卦 陰耗之象 陰氣彌盛 坤地西南\n象曰： 霜雪霏霏，沾我裳衣。 北風吹我，不得旋歸。\n詩曰： 樂極悲生處，黃金昨夜空。 已亡身後計，歸路不亨通。\n";

char gram301[] = "三上一下\n\n無功卦 勞力之象 孤陽失助 乾天西北\n象曰： 東行採藥，乃上泰山。 不得芝草，但見芳蘭。 初非濟用，空手而還。\n詩曰： 見說洛陽花，人心豈不誇。 去時良宵望，歸到已亡家。\n";

char gram302[] = "三上二下\n\n雨災卦 難處之象 陰陽相薄 艮山東北\n象曰： 連降淫雨，洪水滔天。 人民巢居，無有火煙。\n詩曰： 處處生荊棘，鸞皇不可棲。 意窮心更拙，那飽稻梁肥。\n";

char gram303[] = "三上三下\n\n旱災卦 空竭之象 亢陽失陰 乾天西北\n象曰： 炎暑為患，天地焦然。 上天請龍，入地求泉。 惶惶恐懼，人皆不安。\n詩曰： 欲進前程退後難，幾回歡喜幾憂顏。 漫如東海撈明月，費盡精神只等閒。\n";

char gram304[] = "三上四下\n\n遠襲卦 逃散之象 陰陽隔位 艮山東北\n象曰： 追捕寇亡，乃至樂浪。 收我寶玉，牽我中羊。\n詩曰： —牛兩尾事難全，名利順防兩不圓。 遇得木人方有氣，或逢水上亦相便。\n又： 縱然心無厭，誰知不兩全。 殺人雖有恨，自亦損三千。\n";

char gram401[] = "四上一下\n\n盜竊卦 牽系之象 陰伏陽孤 震雷正東\n象曰： 盜人珍寶，欲為己有。 人糾其奸，鬼縛其肘。\n詩曰： 不必勞形役，順防失盜時。 苦求終不悔，反致自身危。\n";

char gram402[] = "四上二下\n\n失律卦 反咎之象 陰竊陽位 坤地西南\n象曰： 違道逆理，陰陽相傷。 皇天不佑，反受其殃。\n詩曰： 旅巢傾覆禍成深。慎事當防獄訟侵。 若欲出行千里外，須憂家裡咎來臨。\n";

char gram403[] = "四上三下\n\n奸黨卦 抑賢之象 陰進陽退 震雷正東\n象曰： 進枉退直，不得其職。 賢人伏藏，君子嘆息。\n詩曰： 順範無一離，詭遇終多獲。 黃鍾埋草莽，瓦釜聲憂憂。\n";

char gram404[] = "四上四下\n\n口舌卦 無吉之象 二陰相克 坤地西南\n象曰： 東家娶婦，西鄰會客。 縛豬啾啾，打狗咋咋。 戒懼禍患，將成災厄。\n詩曰： 口舌向門來，終身且慎災。 家中防暗箭，驚恐又傷財。\n";

char gram100[] = "一上\n\n未明卦 天光之象 孤陽失助 乾天西北\n象曰： 元氣初生，萬物未形。 光明未融，出入冥冥。 始欲運立，百事不成。\n詩曰： 憑心倚望非良策，半似成真半似無。 想望不成無望得，有心反作木求魚。 一木之支，一人莫興。 一將之勇，卒然難平。 建始造功，惟眾可成。\n";

char gram200[] = "二上\n\n遷流卦 未定之象 微陰反位 坤地西南\n象曰： 自天立象，氣尚浮游。 未能審定，東西迂流。 多不遂意，漫漫悠悠。\n詩曰： 干祿誠非利，營求亦有妨。 縱然得亨快，見虎也須防。\n又： 獨陰無助，地廣田虛。 人事未定，不得安居。\n";

char gram300[] = "三上\n\n未寧卦 欠安之象 三陽獨立 乾天西北\n象曰： 天地立形，人乃化生， 隨氣上下，不能自寧。\n詩曰： 驚虛捐失雨重災，謹密行藏慮暗來。 虎尾蛇頭如脫得，此身要泰必虧財。\n又： 二儀立象，三陽不空。 吉凶未辨，焉有所從。\n";

char gram400[] = "四上\n\n死象卦 凶兆之象 重陰反位 坤地西南\n象曰： 人生有死，鬼氣乃興。 四時代謝，寒暑相承。 沉蔽不顯，其體陰凝。\n詩曰： 燕雀動簾幃，驚回夢已違。 幽窗弗管事，也惹是和非。\n又： 病入膏肓氣將絕，魄散魂離脈懼歇。 百年相計等閒拋，縱有盧醫不能活。\n";

char gram10[] = "一中\n\n發陽卦 生意之象 孤陰無主 乾天西北\n象曰： 天光複下，日月發明。 萬事營為，有足皆行。\n詩曰： 恢往有南征，青天日月明。 襄除災已散，名達利還生。\n";

char gram20[] = "二中\n\n歲登勢 遲吉之象 孤陰失助 坤地西南\n象曰： 天地開通，萬物皆隆。 事方決定，歲終大豐。\n詩曰： 自從持守定，功在眾人先。 別有非常喜，隨龍到九天。\n又： 覆載功雖大，猶資雨露先。 待時將有獲，歡樂度豐年。\n";

char gram30[] = "三中\n\n人事勢 大怏之象 盛陽處中 乾天西北\n象曰： 人事方起，吉無不利。 居者得福，行者必至。\n詩曰： 居家多有慶，富貴得平安。 萬事從心起，都來好處看。\n";

char gram40[] = "四中\n\n保身卦 小安之象 積陰居中 坤地西南\n象曰： 鬼氣未盛，厲毒未形。 保慎性命，門戶安寧。\n詩曰： 花逢春雨難留艷，水逐東流怎複波？ 若把利名前路去，卻防閒事暗憂多。\n又： 花開春又去，蝶來花已殘。 惟有青青柏，終能耐歲寒。\n";

char gram1[] = "一下\n\n化育卦 生氣之象 孤陽不明 乾天西北\n象曰： 明明上天，照臨下土。 化育群生，開發門戶。 事皆豁然，更相瞻睹。\n詩曰： 已到平安地，江山萬里程。 綠楊芳草路，風快馬蹄輕。\n";

char gram2[] = "二下\n\n地利卦 安厚之象 陰居陰位 坤地西南\n象曰： 本立事定，人物齊正。 飲食清甘，各保性命。\n詩曰： 杏艷梅香秀氣盈，一番花發一番新。 江南若遇人雙口，變化方知在主人。\n";

char gram3[] = "三下\n\n建候卦 功業之象 三陽助下 乾天西北\n象曰： 事興功起，英雄基址。 聖賢救世，法令得理。\n詩曰： 輕涉波濤一葉舟，如今方得到灘頭。 幾年心事才成就，屈指從前多阻愁。\n又： 天生英雄，肇基宏業。 因民之力，施恩布澤。 君子雍雍，小人孽孽。\n";

char gram4[] = "四下\n\n送終卦 全陰之象 正陰獨權 坤地西南\n象曰： 養生送死，祭祀潔豐。 孝子策杖，衣服粗凶。\n詩曰： 陰人口舌主憂驚，孝子臨門動哭聲。 運退黃金猶失色，雙眉不展事無成。\n";

char gram0[] = "純陰饅\n\n陰饅卦 無形之象\n象曰： 陰饅無象，兆狀未形。 動而有侮，退保其貞。\n詩曰： 逢時多難戰兢兢，戒懼當知履薄冰。 要識前程危與險，不籠風裏一枝燈。\n";
